       IDENTIFICATION DIVISION.
       PROGRAM-ID. REVERSE-STRING.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-STRING   PIC X(64).
       01 WS-TRIMMED  PIC X(64).
       01 WS-REVERSED PIC X(64).
       PROCEDURE DIVISION.
       REVERSE-STRING.
           MOVE FUNCTION TRIM(WS-STRING) TO WS-TRIMMED.
           MOVE FUNCTION REVERSE(WS-TRIMMED) TO WS-REVERSED.
           MOVE SPACES TO WS-STRING.
           MOVE FUNCTION TRIM(WS-REVERSED) TO WS-STRING.